{
  "en": {
    "profileDescription": "I am a System Engineer with diplomas in Python and DevNet, and a technologist in analysis and development of information system. I have 8 years of experience in software development, focusing on backend and frontend, artificial intelligence, implementing monolithic and microservices architectural patterns, distributed systems, and object-oriented programming. I Also have experience in modeling and managing databases, as well as designing UML diagrams, Test-driven development(Tdd). \n\n I possess experience leading both team and individual projects using agile methodologies like Scrum and Kanban, as well as traditional ones, I have been involved in every stage and process, including implementation and deployment, ensuring compliance, usability, scalability, and security. \n\n My experience spans various sectors including banking and finance, payroll and electronic invoicing, social security, travel and tourism, marketing, legal services, public and private services, freelancing, consulting, and teaching programming classes to students.",
    "workExperience": {
      "softwareOne": "- As a Developer, Architecture, Analyst, Designer, Integrator, Tester, Documentation, Assessment, and Estimation of new project or requirements. \n\n- Project reception, new tenders, migrations, development, new functionalities, and deployments, using (Python, FastAPI, Django, Flask, MongoDB, Postgresql) for AFINIA (energy services company). Projects such as (Virtual billing analyst, Virtual intelligence Analysis, Virtual claims Analyst, Optimization and Maintenance of Schedules and Fraud Alarms.) \n\n- Server administration, development of new features, image analysis, best_selling products, statistical data analysis, data transformation, identifying trends and patterns, with (AI, NPL, OCR Optical character recognition, TQDM, NLTK, Poetry, Uvicorn, PySpark, Google Cloud > VM instances, FastApi,  Power BI and MDS, Power Platform, Dataverse.) for Lucro (Alpina, Postobon) projects such as (Recognition Service). \n\n- Support, analysis, and development of new functionalities with (Java, Oracle, Angular, Jacoco) for EMP (Medellin public companies projects such as (Budget capture and Contracting plan). \n\n- Development of a new project, integrations, active directory, microservices with (Java, Spring Boot, AWS, LDAP, Rest, Soap, ChatBoot, Sql y NoSql) for CCB (Camara de comercio). projects such as (Redesign of Registration and payment, Change of Address, Board Members and Mentors, SICO, Immediate Reaction Line). ",
      "stefaniniITSolutions": "- Definition and interpretation of architecture, support in the construction and development of microservices and API's Systems and components integration, data transformation (xml to json), batch services, Pull Request Pipeline, TDD. Managements of clients and companies that contribute to and pay social security as a natural or legal person, using (Python, JavaScript, AWS, S3, EC2, RDS, WAF, Cognito, SQS, SES, Lambda, Secret Manager, DynamoDB,  REST, SOAP, Jenkins, Sql Server, Oracle PL/Sql, Mocks). For projects like (Online Contributions, BBVA Bank, Occidente Banck, AvVilla Banck, Popular Bank, and Mareigua. \n\n- Development of an application that provides insurance for workers who suffer accidents or illnesses), using (Java and Oracle), for the (Alfa Insurance) project. ",
      "carvajalTyS": "- Design, construction, and integration of the solution, implement structure, patterns, and architecture diagrams, development of microservices and APIs, Gateway, system and component integration, data transformation (Xml to Json), batch service, SSL/TLS Certificates, DIAN Service, Electronic signature, Token, Pull Request, Pipeline, using (Java Spring Boot, AWS, S3, EC2, RDS, SQS, Kubernetes, Docker, Angular, Postgresql, SqlServer, REST, SOAP). For the (E_BUSINESS) project (PayRoll). \n\n- Development of a web and mobile application that allows users to register and vote for government elections, as well as view the results, fingerprint reading, barcode, using (Python, Java, Gradle, Oracle, Azure Cloud servers, Angular.) For the project (IDC Citizen election registration, Electronic voting.)",
      "gmlAviatur": "- Development of an application that allows users to purchase airline tickets, hotels, transportation, and tour packages using points that are purchased. This was achieved using microservices, service bus, and both asymmetric and symmetric cryptography, utilizing technologies such as (Java, .Net Core, Google Authentication, OAuth, SqlServer, REST, SOAP, Wsdl, Maven, Hibernate, ORM, Angular, Blazor and Razor). For the company (Aviatur), and the projects (AviaMarketing, Antojese.Travel, Davivienda.)  ",
      "smartLawTech": "- Development of IT solutions using Big Data and Artificial Intelligence applied to legal process management. I created cognitive, automated, and interactive technologies, also designed bots, intuitive, predictive, coherent, and reliable analysis models that contribute to problem_solving through faster and more accurate decision_making such as document download, background and financial statement analysis, and digital signatures. Using the technologies (Python, Java, Selenium, Core NLP, NLTK, Pandas, Google Services, Firebase, postgresql, SqlServer) Projects and clients such as (robots, prozesslaw.com, Bancolombia, BBVA, Davivienda). \n\n- I developed a web app (Control panels and alerts) for monitoring  robots or automated tasks, using (Java and Angular).",
      "novatecSolutions": "- Creation of an in_house web app for (Novatec) that facilitates financial evaluation of its customers, employees, and products, using (Java, Angular, Oracle Sql). \n\n- Development of applications for (BBVA, MetLife, Banco Santander) to enable agile hiring of the bank's products. This involved automation, code quality and load tenting, migration from local to global, banking transactions, financial analysis ad reporting, data transformation, using (microservices, REST, SOAP, WCF, Java, C#, continuous integrations with Jenkins, and MongoDB.)"
    }
  },
  "es": {
    "profileDescription": "Soy Ingeniero de Sistemas con diplomados en Python y DevNet, y tecnólogo en análisis y desarrollo de sistemas de información. Tengo 7 años de experiencia en desarrollo de software, enfocándome en backend y frontend, inteligencia artificial, implementando patrones arquitectónicos monolíticos y de microservicios, sistemas distribuidos y programación orientada a objetos. También tengo experiencia en modelado y gestión de bases de datos, así como en diseño de diagramas UML. \n\n Poseo experiencia liderando proyectos tanto en equipo como individuales utilizando metodologías ágiles como Scrum y Kanban, así como tradicionales, he estado involucrado en cada etapa y proceso, incluyendo implementación y despliegue, asegurando cumplimiento, usabilidad, escalabilidad y seguridad. \n\n Mi experiencia abarca diversos sectores incluyendo banca y finanzas, nómina y facturación electrónica, seguridad social, viajes y turismo, marketing, servicios legales, servicios públicos y privados, freelance, consultoría y enseñanza de clases de programación a estudiantes.",
    "workExperience": {
      "softwareOne": "- Desarrollador, Arquitectura, analista, diseñador, integrador, tester, documentación, valoración y estimación de nuevos proyectos o requisitos.\n\n- Recepción de proyectos, nuevas licitaciones, migración, desarrollo, nuevas funcionalidades, despliegue con (Python, FastApi, Django, Flask, MongoDB, Postgresql), para AFINIA(empresa prestadora de servicios de energía) proyectos como (Analista virtual de facturación, virtual intelligence analysis, analista virtual de reclamo, optimización y mantenimiento de la agenda, Alarmas Fraudes.) \n\n- Administración de proyectos, Servidores, desarrollo nuevas funcionalidades, análisis de imágenes, productos más vendidos, realizar análisis de datos estadísticos, transformación de datos, identificar tendencias y patrones con (AI, NPL, OCR Optical Character recognition, TQDM, NLTK, Poetry, Uvicorn, PySpark,  Google Cloud, instancias VM, FastApi, Power BI y MDS, Power Platform, Dataverse) para Lucro (Alpina, Postobon) proyectos como ( Recognition service) \n\n- Soporte, análisis y desarrollo de nuevas funcionalidades con (Java, Oracle, Angular, Jacoco) para EMP (Empresas públicas de Medellín) proyectos como (Captura de presupuesto, Plan de contratación) \n\n- Desarrollo de un nuevo proyecto, integraciones, directorio activo, microservicios con (Java, Sprint Boot, AWS, LDAP, Rest, Soap, ChatBot) para CCB (Cámara de comercio) proyectos como (Rediseño Registro y pago, Trasladó de domicilio, Miembros y mentores de junta, SICO, Línea de reacción Inmediata).",
      "stefaniniITSolutions": "- Definición e interpretación de la arquitectura, apoyo en la construcción y desarrollo de microservicios y Api's, integración de sistemas y componentes, transformacion de datos (Xml to Json), servicios batch, Pull Request Pipeline, TDD. Gestión de clientes y empresas que aportan y pagan la seguridad social como persona natural o jurídica, con (Python, JavaScript, AWS, S3, EC2, RDS, WAF, Cognito, SQS, SES, Lambda, Secret Manager, DynamoDB,  REST, SOAP, Jenkins, Sql Server, Oracle PL/Sql, Mocks). Para los proyectos(Aportes en línea, Banco BBVA, Banco occidente, Banco AvVillas, Banco Popular, Mareigua).\n\n- Desarrollo de una aplicación que brinda seguros a los trabajadores que sufren accidente o enfermedad, con (Java, Oracle) para el proyecto (Seguros Alfa).",
      "carvajalTyS": "- Diseño, construcción y integración de la solución, implementar estructura, patrones, y diagramas de arquitectura, desarrollo de microservicios y Api's, Gateway, integración de sistemas y componentes, transformación de datos (Xml to Json), servicios batch, Certificados ssl/tls, DIAN Servie, Electronic signature, Token, Pull Request Pipeline, con (Spring Boot, AWS, S3, EC2, RDS, SQS, Kubernetes, Docker, Angular, Postgresql, SqlServer,  REST, SOAP). Para (E_BUSINESS) proyecto (Payroll). \n\n- Desarrollo de una aplicación web y móvil, que permite registrar y votar para las elecciones de gobernantes, así como ver los resultados,  lectura de huella digital, código de barras, con (Python, Java, gradle,  Oracle, Azure Cloud servers.) para el proyecto (IDC, inscripción de ciudadanos elecciones, Voto electrónico).",
      "gmlAviatur": "- Desarrollo de una aplicación que permite comprar tiketes de avión, hoteles, transporte y planes turísticos, por medio de puntos que se compran. Esto se realizó usando microservicios, Bus de servicios, criptografía asimétrica y simétrica usando las tegnologias (Java, .Net Core, Google Autentication OAuth, SqlServer, REST, SOAP, Wsdl, Maven, Hibernate, Orm, Angular, blazor vs razor). Para la empresa (Aviatur) y los proyectos (aviamarketing, Atojese.Travel, Davivienda).",
      "smartLawTech": "- Desarrollo de soluciones informáticas, por medio de ‘Big Data’ e Inteligencia Artificial aplicada a la gestión de procesos jurídicos. Cree tecnologías cognitivas, automatizadas e interactivas, también diseñe bots, modelos de análisis intuitivos, predictivos, coherentes y confiables, que contribuyen a la solución de problemas mediante la toma de decisiones más rápidas y acertadas, como descarga de documentos, análisis de antecedentes y estados financieros, firmas digitales. Usando las tecnologías (Python, Java, Selenium, Core NLP, NLTK, Pandas, Google Services, Firebase, postgresql, SqlServer ) Proyectos y clientes como (robots, prozesslaw.com, Bancolombia, BBVA, Davivienda). \n\n- Desarrolle una app web (tableros de control y alertas), para el monitoreo de los robots o tareas automatizadas, usando (Java y Angular).",
      "novatecSolutions": "- Creación de una app web propia de (Novatec) que permite hacer evaluaciones financieras de sus clientes, trabajadores y productos usando (Java, Angular, Oracle Sql). \n\n- Desarrollo de aplicaciones para (BBVA, MetLife, Banco Santander) que permite la contratación Ágil de los productos del banco. Automatización, calidad de código y pruebas de carga, migración de lo local a lo global, transacciones bancarias, análisis y resultados financieros, transformación de datos, usando (microservicios, rest, soap, wcf, Java, c#, Integración continua con Jenkins, MongoDB)."
    }
  },
  "cloudSkillsTexts": [
    "AWS(Amazon web services)",
    "AWS S3 (Simple storage service)",
    "AWS EC2 (Simple storage service)",
    "AWS Lambda",
    "AWS SQS (Simple queue service)",
    "AWS SES (Simple email service)",
    "AWS Cognito",
    "AWS Secret manager",
    "AWS WAF (Web application firewall)",
    "AWS Cloudwatch",
    "AWS CLI(Command line interface)",
    "AWS IAM(Identity access management)",
    "AWS Fargate (Start serverless Containers)",
    "AWS CodeCommit",
    "AWS CodePipeline(Automate CI/CD Workflows)",
    "AWS KMS(Key management service)",
    "AWS System manager parameter store",
    "AWS Certificate manager SSL/TLS",
    "AWS API Gateway",
    "AWS xRay Collects data",
    "AWS xRay CloudTrail",
    "AWS Batch",
    "AWS ElastiCache",
    "AWS ETL(Extract, Transform, Load)",
    "Google Cloud Secret Manager",
    "Google Cloud storage",
    "Google Cloud Secret Manager",
    "Google Cloud auth",
    "Google Cloud api core"
  ]
}
