{
  "en": {
    "profileDescription": "I am a System Engineer with diplomas in Python and DevNet, and a technologist in analysis and development of information system. I have 7 years of experience in software development, focusing on backend and frontend, artificial intelligence, implementing monolithic and microservices architectural patterns, distributed systems, and object-oriented programming. I Also have experience in modeling and managing databases, as well as designing UML diagrams, Test-driven development(Tdd). \n\n I possess experience leading both team and individual projects using agile methodologies like Scrum and Kanban, as well as traditional ones, I have been involved in every stage and process, including implementation and deployment, ensuring compliance, usability, scalability, and security. \n\n My experience spans various sectors including banking and finance, payroll and electronic invoicing, social security, travel and tourism, marketing, legal services, public and private services, freelancing, consulting, and teaching programming classes to students.",
    "workExperience": {
      "softwareOne": "- As a Developer, Architecture, Analyst, Designer, Integrator, Tester, Documentation, Assessment, and Estimation of new project or requirements. \n\n- Project reception, new tenders, migrations, development, new functionalities, and deployments, using (Python, FastAPI, Django, Flask, Postgresql) for AFINIA (energy services company). Projects such as (Virtual billing analyst, Virtual intelligence Analysis, Virtual claims Analyst, Optimization and Maintenance of Schedules and Fraud Alarms.) \n\n- Server administration, development of new features with (AI, NPL, OCR Optical character recognition, TQDM, NLTK, Poetry, Uvicorn, Google Cloud > VM instances, FastApi) for Lucro (Alpina, Postobon) projects such as (Recognition Service). \n\n- Support, analysis, and development of new functionalities with (Java, Oracle, Angular) for EMP (Medellin public companies projects such as (Budget capture and Contracting plan). \n\n- Development of a new project, integrations, active directory, microservices with (Java, Spring Boot, AWS, LDAP, Rest, Soap, ChatBoot, Sql y NoSql) for CCB (Camara de comercio). projects such as (Redesign of Registration and payment, Change of Address, Board Members and Mentors, SICO, Immediate Reaction Line). ",
      "stefaniniITSolutions": "- As a Developer, Architecture, Analyst, Designer, Integrator, Tester, Documentation, Assessment, and Estimation of new project or requirements. \n\n- Project reception, new tenders, migrations, development, new functionalities, and deployments, using (Python, FastAPI, Django, Flask, Postgresql) for AFINIA (energy services company). Projects such as (Virtual billing analyst, Virtual intelligence Analysis, Virtual claims Analyst, Optimization and Maintenance of Schedules and Fraud Alarms.) \n\n- Server administration, development of new features with (AI, NPL, OCR Optical character recognition, TQDM, NLTK, Poetry, Uvicorn, Google Cloud > VM instances, FastApi) for Lucro (Alpina, Postobon) projects such as (Recognition Service). \n\n- Support, analysis, and development of new functionalities with (Java, Oracle, Angular) for EMP (Medellin public companies projects such as (Budget capture and Contracting plan). \n\n- Development of a new project, integrations, microservices with (Java, Spring Boot, AWS, LDAP, Rest, Soap, ChatBoot, Sql y NoSql) for CCB (Camara de comercio). projects such as (Redesign of Registration and payment, Change of Address, Board Members and Mentors, SICO, Immediate Reaction Line). "
    }
  },
  "es": {
    "profileDescription": "Soy Ingeniero de Sistemas con diplomados en Python y DevNet, y tecnólogo en análisis y desarrollo de sistemas de información. Tengo 7 años de experiencia en desarrollo de software, enfocándome en backend y frontend, inteligencia artificial, implementando patrones arquitectónicos monolíticos y de microservicios, sistemas distribuidos y programación orientada a objetos. También tengo experiencia en modelado y gestión de bases de datos, así como en diseño de diagramas UML. \n\n Poseo experiencia liderando proyectos tanto en equipo como individuales utilizando metodologías ágiles como Scrum y Kanban, así como tradicionales, he estado involucrado en cada etapa y proceso, incluyendo implementación y despliegue, asegurando cumplimiento, usabilidad, escalabilidad y seguridad. \n\n Mi experiencia abarca diversos sectores incluyendo banca y finanzas, nómina y facturación electrónica, seguridad social, viajes y turismo, marketing, servicios legales, servicios públicos y privados, freelance, consultoría y enseñanza de clases de programación a estudiantes.",
    "workExperience": {
      "softwareOne": "- Desarrollador, Arquitectura, analista, diseñador, integrador, tester, documentación, valoración y estimación de nuevos proyectos o requisitos.\n\n- Recepción de proyectos, nuevas licitaciones, migración, desarrollo, nuevas funcionalidades, despliegue con (Python, FastApi, Django, Flask, Postgresql), para AFINIA(empresa prestadora de servicios de energía) proyectos como (Analista virtual de facturación, virtual intelligence analysis, analista virtual de reclamo, optimización y mantenimiento de la agenda, Alarmas Fraudes.) \n\n- Administración de proyectos, Servidores, desarrollo nuevas funcionalidades con (AI, NPL, OCR Optical Character recognition, TQDM, NLTK, Poetry, Uvicorn, Google Cloud, instancias VM, FastApi) para Lucro (Alpina, Postobon) proyectos como ( Recognition service) \n\n- Soporte, análisis y desarrollo de nuevas funcionalidades con (Java, Oracle, Angular) para EMP (Empresas públicas de Medellín) proyectos como (Captura de presupuesto, Plan de contratación) \n\n- Desarrollo de un nuevo proyecto, integraciones, directorio activo, microservicios con (Java, Sprint Boot, AWS, LDAP, Rest, Soap, ChatBot) para CCB (Cámara de comercio) proyectos como (Rediseño Registro y pago, Trasladó de domicilio, Miembros y mentores de junta, SICO, Línea de reacción Inmediata).",
      "stefaniniITSolutions": "- Desarrollador, Arquitectura, analista, diseñador, integrador, tester, documentación, valoración y estimación de nuevos proyectos o requisitos.\n\n- Recepción de proyectos, nuevas licitaciones, migración, desarrollo, nuevas funcionalidades, despliegue con (Python, FastApi, Django, Flask, Postgresql), para AFINIA(empresa prestadora de servicios de energía) proyectos como (Analista virtual de facturación, virtual intelligence analysis, analista virtual de reclamo, optimización y mantenimiento de la agenda, Alarmas Fraudes.) \n\n- Administración de proyectos, Servidores, desarrollo nuevas funcionalidades con (AI, NPL, OCR Optical Character recognition, TQDM, NLTK, Poetry, Uvicorn, Google Cloud, instancias VM, FastApi) para Lucro (Alpina, Postobon) proyectos como ( Recognition service) \n\n- Soporte, análisis y desarrollo de nuevas funcionalidades con (Java, Oracle, Angular) para EMP (Empresas públicas de Medellín) proyectos como (Captura de presupuesto, Plan de contratación) \n\n- Desarrollo de un nuevo proyecto, integraciones, microservicios con (Java, Sprint Boot, AWS, LDAP, Rest, Soap, ChatBot) para CCB (Cámara de comercio) proyectos como (Rediseño Registro y pago, Trasladó de domicilio, Miembros y mentores de junta, SICO, Línea de reacción Inmediata)."
    }
  }
}
